waseltzer/JamStation/instruments/boards.txt
# Spark Board Contribution Configuration
#
# For more information see:
# * https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5---3rd-party-Hardware-specification
# * https://github.com/arduino/Arduino/wiki/Arduino-Hardware-Cores-migration-guide-from-1.0-to-1.6
#

menu.cpu=Processor

################################################################################
################################### RedBoard ###################################
################################################################################
RedBoard.name=SparkFun RedBoard

RedBoard.upload.tool=avrdude
RedBoard.upload.protocol=arduino
RedBoard.upload.maximum_size=32256
RedBoard.upload.maximum_data_size=2048
RedBoard.upload.speed=115200

RedBoard.bootloader.tool=avrdude
RedBoard.bootloader.low_fuses=0xFF
RedBoard.bootloader.high_fuses=0xDE
RedBoard.bootloader.extended_fuses=0x05
RedBoard.bootloader.unlock_bits=0x3F
RedBoard.bootloader.lock_bits=0x0F
RedBoard.bootloader.file=optiboot/optiboot_atmega328.hex

RedBoard.build.mcu=atmega328p
RedBoard.build.f_cpu=16000000L
RedBoard.build.board=AVR_UNO
RedBoard.build.core=arduino:arduino
RedBoard.build.variant=arduino:standard


################################################################################
#################################### MaKey MaKey ###############################
################################################################################
makeymakey.name=SparkFun MaKey MaKey
makeymakey.build.board=AVR_MAKEYMAKEY
makeymakey.build.vid.0=0x1B4F
makeymakey.build.pid.0=0x2B74
makeymakey.build.vid.1=0x1B4F
makeymakey.build.pid.1=0x2B75

makeymakey.upload.tool=arduino:avrdude
makeymakey.upload.protocol=avr109
makeymakey.upload.maximum_size=28672
makeymakey.upload.speed=57600
makeymakey.upload.disable_flushing=true
makeymakey.upload.use_1200bps_touch=true
makeymakey.upload.wait_for_upload_port=true

makeymakey.bootloader.low_fuses=0xFF
makeymakey.bootloader.high_fuses=0xD8
makeymakey.bootloader.extended_fuses=0xF8
makeymakey.bootloader.file=caterina/Caterina-makey.hex
makeymakey.bootloader.unlock_bits=0x3F
makeymakey.bootloader.lock_bits=0x2F
makeymakey.bootloader.tool=arduino:avrdude

makeymakey.build.mcu=atmega32u4
makeymakey.build.f_cpu=16000000L
makeymakey.build.vid=0x1B4F
makeymakey.build.pid=0x2B75
makeymakey.build.usb_product="SparkFun MaKey MaKey"
makeymakey.build.core=arduino:arduino
makeymakey.build.variant=promicro
makeymakey.build.extra_flags={build.usb_flags}
makeymakey.build.usb_manufacturer="SparkFun Electronics"


################################################################################
################################## Pro Micro ###################################
################################################################################
promicro.name=SparkFun Pro Micro

promicro.upload.tool=avrdude
promicro.upload.protocol=avr109
promicro.upload.maximum_size=28672
promicro.upload.maximum_data_size=2560
promicro.upload.speed=57600
promicro.upload.disable_flushing=true
promicro.upload.use_1200bps_touch=true
promicro.upload.wait_for_upload_port=true

promicro.bootloader.tool=avrdude
promicro.bootloader.unlock_bits=0x3F
promicro.bootloader.lock_bits=0x2F
promicro.bootloader.low_fuses=0xFF
promicro.bootloader.high_fuses=0xD8

promicro.build.board=AVR_PROMICRO
promicro.build.core=arduino:arduino
promicro.build.variant=promicro
promicro.build.mcu=atmega32u4
promicro.build.usb_product="SparkFun Pro Micro"
promicro.build.vid=0x1b4f
promicro.build.extra_flags={build.usb_flags}

######################### Pro Micro 3.3V / 8MHz ################################
promicro.menu.cpu.8MHzatmega32U4=ATmega32U4 (3.3V, 8 MHz)

promicro.menu.cpu.8MHzatmega32U4.build.pid.0=0x9203
promicro.menu.cpu.8MHzatmega32U4.build.pid.1=0x9204
promicro.menu.cpu.8MHzatmega32U4.build.pid=0x9204
promicro.menu.cpu.8MHzatmega32U4.build.f_cpu=8000000L

promicro.menu.cpu.8MHzatmega32U4.bootloader.extended_fuses=0xFE
promicro.menu.cpu.8MHzatmega32U4.bootloader.file=caterina/Caterina-promicro8.hex


############################# Pro Micro 5V / 16MHz #############################
promicro.menu.cpu.16MHzatmega32U4=ATmega32U4 (5V, 16 MHz)

promicro.menu.cpu.16MHzatmega32U4.build.pid.0=0x9205
promicro.menu.cpu.16MHzatmega32U4.build.pid.1=0x9206
promicro.menu.cpu.16MHzatmega32U4.build.pid=0x9206
promicro.menu.cpu.16MHzatmega32U4.build.f_cpu=16000000L

promicro.menu.cpu.16MHzatmega32U4.bootloader.extended_fuses=0xCB
promicro.menu.cpu.16MHzatmega32U4.bootloader.file=caterina/Caterina-promicro16.hex

################################################################################
################################## Chimes Pro Micro ###################################
################################################################################
chimespromicro.name=Chimes SparkFun Pro Micro

chimespromicro.upload.tool=avrdude
chimespromicro.upload.protocol=avr109
chimespromicro.upload.maximum_size=28672
chimespromicro.upload.maximum_data_size=2560
chimespromicro.upload.speed=57600
chimespromicro.upload.disable_flushing=true
chimespromicro.upload.use_1200bps_touch=true
chimespromicro.upload.wait_for_upload_port=true

chimespromicro.bootloader.tool=avrdude
chimespromicro.bootloader.unlock_bits=0x3F
chimespromicro.bootloader.lock_bits=0x2F
chimespromicro.bootloader.low_fuses=0xFF
chimespromicro.bootloader.high_fuses=0xD8

chimespromicro.build.board=AVR_promicro
chimespromicro.build.core=arduino:arduino
chimespromicro.build.variant=promicro
chimespromicro.build.mcu=atmega32u4
chimespromicro.build.usb_product="Chimes SparkFun Pro Micro"
chimespromicro.build.vid=0xfff1
chimespromicro.build.extra_flags={build.usb_flags}


############################# Chimes Pro Micro 5V / 16MHz #############################
chimespromicro.menu.cpu.16MHzatmega32U4=ATmega32U4 (5V, 16 MHz)

chimespromicro.menu.cpu.16MHzatmega32U4.build.pid.0=0x9205
chimespromicro.menu.cpu.16MHzatmega32U4.build.pid.1=0x9206
chimespromicro.menu.cpu.16MHzatmega32U4.build.pid=0x9206
chimespromicro.menu.cpu.16MHzatmega32U4.build.f_cpu=16000000L

