waseltzer/JamStation/instruments/boards.txt
chimespromicro.menu.cpu.16MHzatmega32U4.bootloader.extended_fuses=0xCB
chimespromicro.menu.cpu.16MHzatmega32U4.bootloader.file=caterina/Caterina-promicro16.hex

################################################################################
################################## Pipes Pro Micro ###################################
################################################################################
pipespromicro.name=Pipes SparkFun Pro Micro

pipespromicro.upload.tool=avrdude
pipespromicro.upload.protocol=avr109
pipespromicro.upload.maximum_size=28672
pipespromicro.upload.maximum_data_size=2560
pipespromicro.upload.speed=57600
pipespromicro.upload.disable_flushing=true
pipespromicro.upload.use_1200bps_touch=true
pipespromicro.upload.wait_for_upload_port=true

pipespromicro.bootloader.tool=avrdude
pipespromicro.bootloader.unlock_bits=0x3F
pipespromicro.bootloader.lock_bits=0x2F
pipespromicro.bootloader.low_fuses=0xFF
pipespromicro.bootloader.high_fuses=0xD8

pipespromicro.build.board=AVR_promicro
pipespromicro.build.core=arduino:arduino
pipespromicro.build.variant=promicro
pipespromicro.build.mcu=atmega32u4
pipespromicro.build.usb_product="Pipes SparkFun Pro Micro"
pipespromicro.build.vid=0xffe1
pipespromicro.build.extra_flags={build.usb_flags}


############################# Pipes Pro Micro 5V / 16MHz #############################
pipespromicro.menu.cpu.16MHzatmega32U4=ATmega32U4 (5V, 16 MHz)

pipespromicro.menu.cpu.16MHzatmega32U4.build.pid.0=0x9205
pipespromicro.menu.cpu.16MHzatmega32U4.build.pid.1=0x9206
pipespromicro.menu.cpu.16MHzatmega32U4.build.pid=0x9206
pipespromicro.menu.cpu.16MHzatmega32U4.build.f_cpu=16000000L

pipespromicro.menu.cpu.16MHzatmega32U4.bootloader.extended_fuses=0xCB
pipespromicro.menu.cpu.16MHzatmega32U4.bootloader.file=caterina/Caterina-promicro16.hex

################################################################################
################################## Drums Pro Micro ###################################
################################################################################
drumspromicro.name=Drums SparkFun Pro Micro

drumspromicro.upload.tool=avrdude
drumspromicro.upload.protocol=avr109
drumspromicro.upload.maximum_size=28672
drumspromicro.upload.maximum_data_size=2560
drumspromicro.upload.speed=57600
drumspromicro.upload.disable_flushing=true
drumspromicro.upload.use_1200bps_touch=true
drumspromicro.upload.wait_for_upload_port=true

drumspromicro.bootloader.tool=avrdude
drumspromicro.bootloader.unlock_bits=0x3F
drumspromicro.bootloader.lock_bits=0x2F
drumspromicro.bootloader.low_fuses=0xFF
drumspromicro.bootloader.high_fuses=0xD8

drumspromicro.build.board=AVR_promicro
drumspromicro.build.core=arduino:arduino
drumspromicro.build.variant=promicro
drumspromicro.build.mcu=atmega32u4
drumspromicro.build.usb_product="Drums SparkFun Pro Micro"
drumspromicro.build.vid=0xffd1
drumspromicro.build.extra_flags={build.usb_flags}


############################# Drums Pro Micro 5V / 16MHz #############################
drumspromicro.menu.cpu.16MHzatmega32U4=ATmega32U4 (5V, 16 MHz)

drumspromicro.menu.cpu.16MHzatmega32U4.build.pid.0=0x9205
drumspromicro.menu.cpu.16MHzatmega32U4.build.pid.1=0x9206
drumspromicro.menu.cpu.16MHzatmega32U4.build.pid=0x9206
drumspromicro.menu.cpu.16MHzatmega32U4.build.f_cpu=16000000L

drumspromicro.menu.cpu.16MHzatmega32U4.bootloader.extended_fuses=0xCB
drumspromicro.menu.cpu.16MHzatmega32U4.bootloader.file=caterina/Caterina-promicro16.hex


################################################################################
############################## Fio v3 3.3V / 8MHz ##############################
################################################################################
fiov3.name=SparkFun Fio v3
fiov3.build.board=AVR_FIOV3
fiov3.build.vid.0=0x1B4F
fiov3.build.pid.0=0xF100
fiov3.build.vid.1=0x1B4F
fiov3.build.pid.1=0xF101

fiov3.upload.tool=arduino:avrdude
fiov3.upload.protocol=avr109
fiov3.upload.maximum_size=28672
fiov3.upload.speed=57600
fiov3.upload.disable_flushing=true
fiov3.upload.use_1200bps_touch=true
fiov3.upload.wait_for_upload_port=true

fiov3.bootloader.low_fuses=0xFF
fiov3.bootloader.high_fuses=0xD8
fiov3.bootloader.extended_fuses=0xFC
fiov3.bootloader.file=caterina/Caterina-fio.hex
fiov3.bootloader.unlock_bits=0x3F
fiov3.bootloader.lock_bits=0x2F
fiov3.bootloader.tool=arduino:avrdude

fiov3.build.mcu=atmega32u4
fiov3.build.f_cpu=8000000L
fiov3.build.vid=0x1B4F
fiov3.build.pid=0xF101
fiov3.build.usb_product="SparkFun Fio v3"
fiov3.build.core=arduino:arduino
fiov3.build.variant=promicro
fiov3.build.extra_flags={build.usb_flags}
fiov3.build.usb_manufacturer="SparkFun Electronics"


################################################################################
################################ Qduino Mini ###################################
################################################################################
qduinomini.name=Qduino Mini
qduinomini.build.vid.0=0x1B4F
qduinomini.build.pid.0=0x514D
qduinomini.build.vid.1=0x1B4F
qduinomini.build.pid.1=0x516D

qduinomini.upload.tool=arduino:avrdude
qduinomini.upload.protocol=avr109
qduinomini.upload.maximum_size=28672
qduinomini.upload.maximum_data_size=2560
qduinomini.upload.speed=57600
qduinomini.upload.disable_flushing=true
qduinomini.upload.use_1200bps_touch=true
qduinomini.upload.wait_for_upload_port=true

qduinomini.bootloader.tool=arduino:avrdude
qduinomini.bootloader.low_fuses=0xFF
qduinomini.bootloader.high_fuses=0xD8
qduinomini.bootloader.extended_fuses=0xCC
qduinomini.bootloader.file=caterina/Caterina-qduinomini.hex
qduinomini.bootloader.unlock_bits=0x3F
qduinomini.bootloader.lock_bits=0x2F

qduinomini.build.mcu=atmega32u4
qduinomini.build.f_cpu=8000000L
qduinomini.build.vid=0x1B4F
qduinomini.build.pid=0x516D
qduinomini.build.usb_product="Qtechknow Qduino Mini"
qduinomini.build.board=AVR_QDUINOMINI
qduinomini.build.core=arduino:arduino
qduinomini.build.variant=promicro
qduinomini.build.extra_flags={build.usb_flags}
qduinomini.build.usb_manufacturer="SparkFun Electronics"

################################################################################
################################ Digital Sandbox ###############################
################################################################################
digitalsandbox.name=SparkFun Digital Sandbox
digitalsandbox.build.board=AVR_DIGITAL_SANDBOX

digitalsandbox.upload.tool=arduino:avrdude
digitalsandbox.upload.protocol=arduino
digitalsandbox.upload.maximum_size=32256
digitalsandbox.upload.speed=57600
digitalsandbox.upload.maximum_data_size=2048

digitalsandbox.bootloader.low_fuses=0xFF
digitalsandbox.bootloader.high_fuses=0xDE
digitalsandbox.bootloader.extended_fuses=0x05
digitalsandbox.bootloader.file=optiboot/optiboot_atmega328.hex
digitalsandbox.bootloader.unlock_bits=0x3F
digitalsandbox.bootloader.lock_bits=0x2F
digitalsandbox.bootloader.tool=arduino:avrdude

digitalsandbox.build.mcu=atmega328p
# Can run at less than 5V on battery, so run at only 8MHz
digitalsandbox.build.f_cpu=8000000L
digitalsandbox.build.core=arduino:arduino
digitalsandbox.build.variant=digitalsandbox


################################################################################
################################### Mega Pro ###################################
################################################################################
megapro.name=SparkFun Mega Pro

megapro.upload.tool=arduino:avrdude
megapro.upload.protocol=wiring
megapro.upload.maximum_data_size=8192

megapro.bootloader.tool=avrdude
megapro.bootloader.unlock_bits=0x3F
megapro.bootloader.lock_bits=0x0F

megapro.build.board=AVR_MEGA2560
megapro.build.core=arduino:arduino
megapro.build.variant=arduino:mega
megapro.build.mcu=atmega2560

################################# Mega Pro 3.3V ################################
megapro.menu.cpu.atmega25603V3=ATmega2560 (3.3V / 8 MHz)

megapro.menu.cpu.atmega25603V3.upload.maximum_size=258048
megapro.menu.cpu.atmega25603V3.upload.speed=57600

megapro.menu.cpu.atmega25603V3.bootloader.low_fuses=0xFD
megapro.menu.cpu.atmega25603V3.bootloader.high_fuses=0xD4
megapro.menu.cpu.atmega25603V3.bootloader.extended_fuses=0xFD
megapro.menu.cpu.atmega25603V3.bootloader.file=mega/MegaPro3.3V-8MHz-57600.hex

