waseltzer/JamStation/instruments/boards.txt
megapro.menu.cpu.atmega25603V3.build.f_cpu=8000000L

################################# Mega Pro 5V ##################################
megapro.menu.cpu.atmega25605V=ATmega2560 (5V / 16 MHz)

megapro.menu.cpu.atmega25605V.upload.maximum_size=253952
megapro.menu.cpu.atmega25605V.upload.speed=115200

megapro.menu.cpu.atmega25605V.bootloader.low_fuses=0xFF
megapro.menu.cpu.atmega25605V.bootloader.high_fuses=0xD8
megapro.menu.cpu.atmega25605V.bootloader.extended_fuses=0xFD
megapro.menu.cpu.atmega25605V.bootloader.file=arduino:stk500v2/stk500boot_v2_mega2560.hex

megapro.menu.cpu.atmega25605V.build.f_cpu=16000000L


################################################################################
#################################### RedBot ####################################
################################################################################
RedBot.name=SparkFun RedBot

RedBot.upload.tool=avrdude
RedBot.upload.protocol=arduino
RedBot.upload.maximum_size=32256
RedBot.upload.maximum_data_size=2048
RedBot.upload.speed=115200

RedBot.bootloader.tool=avrdude
RedBot.bootloader.low_fuses=0xFF
RedBot.bootloader.high_fuses=0xDE
RedBot.bootloader.extended_fuses=0x05
RedBot.bootloader.unlock_bits=0x3F
RedBot.bootloader.lock_bits=0x0F
RedBot.bootloader.file=optiboot/optiboot_atmega328.hex

RedBot.build.mcu=atmega328p
RedBot.build.f_cpu=16000000L
RedBot.build.board=REDBOT
RedBot.build.core=arduino:arduino
RedBot.build.variant=arduino:standard


################################################################################
############################ Serial 7-Segment Display ##########################
################################################################################
Serial7Seg.name=SparkFun Serial 7-Segment Display
Serial7Seg.build.board=AVR_SERIAL_7_SEGMENT

Serial7Seg.upload.tool=arduino:avrdude
Serial7Seg.upload.protocol=arduino
Serial7Seg.upload.maximum_size=32256
Serial7Seg.upload.speed=57600
Serial7Seg.upload.maximum_data_size=2048

# Use internal oscillator @ 8MHz / 8 (0xE2)
Serial7Seg.bootloader.low_fuses=0xE2
Serial7Seg.bootloader.high_fuses=0xDE
Serial7Seg.bootloader.extended_fuses=0x05
Serial7Seg.bootloader.file=optiboot/optiboot_serial7Seg.hex
Serial7Seg.bootloader.unlock_bits=0x3F
Serial7Seg.bootloader.lock_bits=0x2F
Serial7Seg.bootloader.tool=arduino:avrdude

Serial7Seg.build.mcu=atmega328p
Serial7Seg.build.f_cpu=8000000L
Serial7Seg.build.core=arduino:arduino
Serial7Seg.build.variant=ser7seg


################################################################################
###################### ATmega128RFA1 Development Board #########################
################################################################################
atmega128rfa1.name=SparkFun ATmega128RFA1 Dev Board

atmega128rfa1.upload.tool=arduino:avrdude
atmega128rfa1.upload.protocol=arduino
atmega128rfa1.upload.maximum_size=126976
atmega128rfa1.upload.maximum_data_size=16384
atmega128rfa1.upload.speed=57600

atmega128rfa1.bootloader.tool=avrdude
atmega128rfa1.bootloader.low_fuses=0xFF
atmega128rfa1.bootloader.high_fuses=0xDA
atmega128rfa1.bootloader.extended_fuses=0xF5
atmega128rfa1.bootloader.unlock_bits=0x3F
atmega128rfa1.bootloader.lock_bits=0x0F
atmega128rfa1.bootloader.file=atmega/ATmegaBOOT_168_atmega128rfa1.hex

atmega128rfa1.build.mcu=atmega128rfa1
atmega128rfa1.build.f_cpu=16000000L
atmega128rfa1.build.board=ATMEGA128RFA1_DEV_BOARD
atmega128rfa1.build.core=arduino:arduino
atmega128rfa1.build.variant=rf128

################################################################################
############################# LilyPad USB Plus #################################
################################################################################

LilyPadProtoUSB.name=LilyPad USB Plus
LilyPadProtoUSB.vid.0=0x1B4F
LilyPadProtoUSB.pid.0=0x0110

LilyPadProtoUSB.upload.tool=avrdude
LilyPadProtoUSB.upload.protocol=avr109
LilyPadProtoUSB.upload.maximum_size=28672
LilyPadProtoUSB.upload.maximum_data_size=2560
LilyPadProtoUSB.upload.speed=57600
LilyPadProtoUSB.upload.disable_flushing=true
LilyPadProtoUSB.upload.use_1200bps_touch=true
LilyPadProtoUSB.upload.wait_for_upload_port=true

LilyPadProtoUSB.bootloader.tool=avrdude
LilyPadProtoUSB.bootloader.low_fuses=0xff
LilyPadProtoUSB.bootloader.high_fuses=0xd8
LilyPadProtoUSB.bootloader.extended_fuses=0xce
LilyPadProtoUSB.bootloader.file=caterina/Caterina-lilypadusbplus.hex
LilyPadProtoUSB.bootloader.unlock_bits=0x3F
LilyPadProtoUSB.bootloader.lock_bits=0x2F

LilyPadProtoUSB.build.mcu=atmega32u4
LilyPadProtoUSB.build.f_cpu=8000000L
LilyPadProtoUSB.build.vid=0x1B4F
LilyPadProtoUSB.build.pid=0x0110
LilyPadProtoUSB.build.usb_product="LilyPad USB Plus"
LilyPadProtoUSB.build.board=AVR_LILYPAD_ARDUINO_USB_PLUS_BOARD
LilyPadProtoUSB.build.core=arduino:arduino
LilyPadProtoUSB.build.variant=lilypadusbplus
LilyPadProtoUSB.build.extra_flags={build.usb_flags}


################################################################################
################################### SerLCD #####################################
################################################################################
SerLCD.name=SparkFun SerLCD

SerLCD.upload.tool=avrdude
SerLCD.upload.protocol=arduino
SerLCD.upload.maximum_size=32256
SerLCD.upload.maximum_data_size=2048
SerLCD.upload.speed=115200

SerLCD.bootloader.tool=avrdude
SerLCD.bootloader.low_fuses=0xFF
SerLCD.bootloader.high_fuses=0xDE
SerLCD.bootloader.extended_fuses=0xFD
SerLCD.bootloader.unlock_bits=0x3F
SerLCD.bootloader.lock_bits=0x0F
SerLCD.bootloader.file=optiboot/optiboot_SerLCD.hex

SerLCD.build.mcu=atmega328p
SerLCD.build.f_cpu=11059200L
SerLCD.build.board=AVR_UNO
SerLCD.build.core=arduino:arduino
SerLCD.build.variant=arduino:standard
